In [3]:
import pandas as pd
a=[4, 8, 15, 16, 23,42]
s=pd.Series(a)

In [4]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
a=[1,2,3,4,5,6,7,8,9,10]
b=pd.Series(a)

In [6]:
b

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
d={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}
c=pd.DataFrame(d)

In [11]:
c

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
c.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [14]:
s=pd.Series([1,2,3])
s1=pd.Series([4,5,6])
s2=pd.Series([3,2,1])

In [18]:
df=pd.DataFrame([s,s2,)

In [19]:
df

   0
0  1
1  2
2  3